RESULTS/PERFCNTR/sqlite_fullpersist_disablog_HWCNTR_all.out
Enter application name and arguments as params for the script
Enter application name and arguments as params for the script
Keys:       16 bytes each
Values:     100 bytes each
Entries:    300000
RawSize:    33.2 MB (estimated)
------------------------------------------------
fillseq      :      15.968 micros/op;    6.9 MB/s
fillseqsync  :      17.729 micros/op;    6.2 MB/s (3000 ops)
fillseqbatch :       4.659 micros/op;   23.7 MB/s
fillrandom   :      19.146 micros/op;    5.8 MB/s
fillrandsync :      19.713 micros/op;    5.6 MB/s (3000 ops)
fillrandbatch :      11.172 micros/op;    9.9 MB/s
overwrite    :      21.990 micros/op;    5.0 MB/s
overwritebatch :      16.185 micros/op;    6.8 MB/s
readrandom   :       4.382 micros/op;
readseq      :       1.544 micros/op;   61.8 MB/s
fillrand100K :     232.507 micros/op;  410.2 MB/s (300 ops)
fillseq100K  :     103.416 micros/op;  922.3 MB/s (300 ops)
readseq      :      17.373 micros/op; 5489.5 MB/s
readrand100K :      20.607 micros/op;
             :       0.954 micros/op;
-------------------------------------------------------------
-------------------------------------------------------------
CPU type:	Intel Core Haswell processor 
CPU clock:	3.39 GHz 
-------------------------------------------------------------
/home/sudarsun/libs/linux-examples/leveldb-1.14.0/db_bench_mem_sqlite3_atomic
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+--------+
|                   Event                   |   core 0    |   core 1    |   core 2    |   core 3    | core 4 | core 5 | core 6 | core 7 |
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+--------+
|             INSTR_RETIRED_ANY             | 9.46894e+10 | 2.04809e+09 | 9.73794e+08 | 1.21489e+07 |   0    |   0    |   0    |   0    |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM | 2.99883e+07 | 2.20058e+06 | 1.2767e+06  |    3663     |   0    |   0    |   0    |   0    |
|           MEM_UOP_RETIRED_LOADS           | 3.91276e+10 | 6.44654e+08 | 2.97559e+08 | 3.63153e+06 |   0    |   0    |   0    |   0    |
|          MEM_UOP_RETIRED_STORES           | 1.72695e+10 | 2.8538e+08  | 2.22643e+08 | 2.99763e+06 |   0    |   0    |   0    |   0    |
|             INSTR_RETIRED_ANY             | 9.46894e+10 | 2.04809e+09 | 9.73794e+08 | 1.21489e+07 |   0    |   0    |   0    |   0    |
|           CPU_CLK_UNHALTED_CORE           | 7.03657e+10 | 1.33585e+09 | 1.38001e+09 | 1.96062e+07 |   0    |   0    |   0    |   0    |
|           CPU_CLK_UNHALTED_REF            | 6.1359e+10  | 1.16692e+09 | 1.20641e+09 | 1.71021e+07 |   0    |   0    |   0    |   0    |
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+--------+
+------------------------------------------------+-------------+-------------+-----+-------------+
|                     Event                      |     Sum     |     Max     | Min |     Avg     |
+------------------------------------------------+-------------+-------------+-----+-------------+
|             INSTR_RETIRED_ANY STAT             | 9.77235e+10 | 9.46894e+10 |  0  | 1.22154e+10 |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM STAT | 3.34693e+07 | 2.99883e+07 |  0  | 4.18366e+06 |
|           MEM_UOP_RETIRED_LOADS STAT           | 4.00735e+10 | 3.91276e+10 |  0  | 5.00919e+09 |
|          MEM_UOP_RETIRED_STORES STAT           | 1.77806e+10 | 1.72695e+10 |  0  | 2.22257e+09 |
|             INSTR_RETIRED_ANY STAT             | 9.77235e+10 | 9.46894e+10 |  0  | 1.22154e+10 |
|           CPU_CLK_UNHALTED_CORE STAT           | 7.31012e+10 | 7.03657e+10 |  0  | 9.13765e+09 |
|           CPU_CLK_UNHALTED_REF STAT            | 6.37494e+10 | 6.1359e+10  |  0  | 7.96868e+09 |
+------------------------------------------------+-------------+-------------+-----+-------------+
+----------------------+----------+----------+----------+------------+---------+---------+---------+---------+
|        Metric        |  core 0  |  core 1  |  core 2  |   core 3   | core 4  | core 5  | core 6  | core 7  |
+----------------------+----------+----------+----------+------------+---------+---------+---------+---------+
| Runtime (RDTSC) [s]  | 28.8236  | 28.8236  | 28.8236  |  28.8236   | 28.8236 | 28.8236 | 28.8236 | 28.8236 |
| Runtime unhalted [s] | 20.7437  | 0.393806 | 0.406827 | 0.00577989 |    0    |    0    |    0    |    0    |
|     Clock [MHz]      | 3890.07  | 3883.21  | 3880.27  |  3888.82   |    0    |    0    |    0    |    0    |
|         CPI          | 0.743121 | 0.652239 | 1.41715  |  1.61383   |    0    |    0    |    0    |    0    |
+----------------------+----------+----------+----------+------------+---------+---------+---------+---------+
Enter application name and arguments as params for the script
Keys:       16 bytes each
Values:     100 bytes each
Entries:    300000
RawSize:    33.2 MB (estimated)
------------------------------------------------
fillseq      :      16.083 micros/op;    6.9 MB/s
fillseqsync  :      17.683 micros/op;    6.3 MB/s (3000 ops)
fillseqbatch :       4.756 micros/op;   23.3 MB/s
fillrandom   :      19.200 micros/op;    5.8 MB/s
fillrandsync :      19.739 micros/op;    5.6 MB/s (3000 ops)
fillrandbatch :      11.194 micros/op;    9.9 MB/s
overwrite    :      22.010 micros/op;    5.0 MB/s
overwritebatch :      16.094 micros/op;    6.9 MB/s
readrandom   :       4.445 micros/op;
readseq      :       1.557 micros/op;   61.3 MB/s
fillrand100K :     232.514 micros/op;  410.2 MB/s (300 ops)
fillseq100K  :     102.840 micros/op;  927.5 MB/s (300 ops)
readseq      :      17.327 micros/op; 5504.1 MB/s
readrand100K :      19.577 micros/op;
             :       0.954 micros/op;
-------------------------------------------------------------
-------------------------------------------------------------
CPU type:	Intel Core Haswell processor 
CPU clock:	3.39 GHz 
-------------------------------------------------------------
/home/sudarsun/libs/linux-examples/leveldb-1.14.0/db_bench_mem_sqlite3_atomic
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+-------------+-------------+--------+
|                   Event                   |   core 0    |   core 1    |   core 2    |   core 3    | core 4 |   core 5    |   core 6    | core 7 |
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+-------------+-------------+--------+
|             INSTR_RETIRED_ANY             | 9.46894e+10 | 2.01911e+09 | 2.38956e+08 | 1.16529e+07 |   0    | 7.18176e+06 | 8.7352e+08  |  2849  |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM | 3.03256e+07 | 2.26099e+06 |    71440    |    2092     |   0    |    6524     |   599136    |   59   |
|           MEM_UOP_RETIRED_LOADS           | 3.91276e+10 | 6.38516e+08 | 7.32094e+07 | 2.73856e+06 |   0    | 1.90015e+06 | 2.66005e+08 |  661   |
|          MEM_UOP_RETIRED_STORES           | 1.72695e+10 | 2.38163e+08 | 5.74186e+07 | 1.29185e+06 |   0    |   994855    | 2.24085e+08 |  469   |
|             INSTR_RETIRED_ANY             | 9.46894e+10 | 2.01911e+09 | 2.38956e+08 | 1.16529e+07 |   0    | 7.18176e+06 | 8.7352e+08  |  2849  |
|           CPU_CLK_UNHALTED_CORE           | 7.0683e+10  | 9.61839e+08 | 3.64049e+08 | 6.0599e+06  |   0    | 9.33127e+06 | 1.45242e+09 | 33555  |
|           CPU_CLK_UNHALTED_REF            | 6.16443e+10 | 8.40485e+08 | 3.21417e+08 | 5.51806e+06 |   0    | 8.39501e+06 | 1.26681e+09 | 29274  |
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+-------------+-------------+--------+
+------------------------------------------------+-------------+-------------+-----+-------------+
|                     Event                      |     Sum     |     Max     | Min |     Avg     |
+------------------------------------------------+-------------+-------------+-----+-------------+
|             INSTR_RETIRED_ANY STAT             | 9.78398e+10 | 9.46894e+10 |  0  |  1.223e+10  |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM STAT | 3.32659e+07 | 3.03256e+07 |  0  | 4.15823e+06 |
|           MEM_UOP_RETIRED_LOADS STAT           |  4.011e+10  | 3.91276e+10 |  0  | 5.01375e+09 |
|          MEM_UOP_RETIRED_STORES STAT           | 1.77915e+10 | 1.72695e+10 |  0  | 2.22394e+09 |
|             INSTR_RETIRED_ANY STAT             | 9.78398e+10 | 9.46894e+10 |  0  |  1.223e+10  |
|           CPU_CLK_UNHALTED_CORE STAT           | 7.34767e+10 | 7.0683e+10  |  0  | 9.18459e+09 |
|           CPU_CLK_UNHALTED_REF STAT            | 6.40869e+10 | 6.16443e+10 |  0  | 8.01086e+09 |
+------------------------------------------------+-------------+-------------+-----+-------------+
+----------------------+----------+----------+----------+------------+---------+------------+----------+-------------+
|        Metric        |  core 0  |  core 1  |  core 2  |   core 3   | core 4  |   core 5   |  core 6  |   core 7    |
+----------------------+----------+----------+----------+------------+---------+------------+----------+-------------+
| Runtime (RDTSC) [s]  | 28.8497  | 28.8497  | 28.8497  |  28.8497   | 28.8497 |  28.8497   | 28.8497  |   28.8497   |
| Runtime unhalted [s] | 20.8373  | 0.283549 | 0.107321 | 0.00178645 |    0    | 0.00275085 | 0.428171 | 9.89198e-06 |
|     Clock [MHz]      | 3889.52  | 3881.92  | 3842.06  |  3725.23   |    0    |  3770.46   | 3889.15  |   3888.21   |
|         CPI          | 0.746472 | 0.476369 | 1.52349  |  0.520034  |    0    |   1.2993   | 1.66272  |   11.7778   |
+----------------------+----------+----------+----------+------------+---------+------------+----------+-------------+